{"q_list": [[{"correct_answer": "D", "type ": "MC", "A_q": "The task of creating a portrait is a complex one and should be studied step by step rather than in full. hence, rajeev should identify what parts of the portrait are problematic and practice them regularly instead of drawing new full portrait every day.", "B_q": "Lack of deliberate practice, to say, always practice a general and broad task set without pinpointing where exactly is not good.", "C_q": "Even without deliberate practice, rajeev could improve his skill by practice. if his skill doesn't improve at all, that is not a problem of deliberate practice, it's a problem that he didn't practice the same skill every day. he is not practicing a specific skill (draw the eye of the portrait). although the lack of feedback is also important, it's more important to focus on the same practice)", "D_q": "He is not doing deliberate practice. b/c there is no feedback provided."}, {"correct_answer": ["D", "A"], "type ": "SA", "A_q": "I don't think so. because he does not have the expertise to give himself corrective feedback.", "B_q": "No, because there is not an external agent providing instructive and immediate feedback in dan's practice.", "C_q": "Not receiving immediate feedback may make rajeev not yield an improvement.", "D_q": "The feedback needs to be given by an external agent."}, {"correct_answer": ["C", "B"], "type ": "SA", "A_q": "Great job. keep working and putting effort, you will improve more quickly.", "B_q": "As mark has practiced fo long hours, he has probably overcome many difficulties while learning his favorite song. the instructor should point out these difficulties and how mark overcame them as constructive feedback which can help build the growth-mindset by highlighting that he has already grown from his initial stage.", "C_q": "Great, you are doing well on this song because of your hard practice. you could do better on other songs and more complex skills if you continue to practice like this.", "D_q": "What a great job that you achieved the goal of playing your favorite song. it is also great for your persistence of learning and practicing."}, {"correct_answer": "B", "type ": "MC", "A_q": "Yes, students are encouraged to learn , express, they are seeing others rely on themselves and see themselves improve.", "B_q": "No, because it doesn’t implicate how the brain works, and the malleable nature of intelligence. jigsaw doesn't help students or teachers discover why it works, it doesn't help intelligence either.", "C_q": "I think so. because jigsaw demonstrates to students that they can always learn from other people. what's more, it shows that they can not only learn themselves, but also help other people to improve together.", "D_q": "Yes indeed! the jigsaw method creates a growth mindset because through the process students are going through walks them through a process in which their own competence is demonstrated back to them and they are supported by the other students on their team. this translates to them feeling their own ability to succeed and increase their intelligence in the future."}], [{"correct_answer": "A", "type ": "MC", "A_q": "Currently, rajeev is not receiving feedback and remedial instruction for his work which are an integral part of deliberate practice.", "B_q": "The task of creating a portrait is a complex one and should be studied step by step rather than in full. hence, rajeev should identify what parts of the portrait are problematic and practice them regularly instead of drawing new full portrait every day.", "C_q": "Even without deliberate practice, rajeev could improve his skill by practice. if his skill doesn't improve at all, that is not a problem of deliberate practice, it's a problem that he didn't practice the same skill every day. he is not practicing a specific skill (draw the eye of the portrait). although the lack of feedback is also important, it's more important to focus on the same practice)", "D_q": "Lack of deliberate practice, to say, always practice a general and broad task set without pinpointing where exactly is not good."}, {"correct_answer": ["C", "B"], "type ": "SA", "A_q": "No, because deliberate practice requires that an external agent provide feedback to the learner.", "B_q": "Dan is not engaged in deliberate practice because he is missing expert feedback. he may be unable to precisely diagnose his mistakes and/or to formulate an optimal plan to address them without supervision. additionally waiting until the next day to address problems undermines his ability to relate errors to corrections and further removes his routine from deliberate practice.", "C_q": "It is. because it includes practice on a specific skill, supervised by himself, get feedback from himself, and remedial training the next day.", "D_q": "Yes, he has isolated a specific task, practices it repeatedly and reviews his sessions to narrow on improvements."}, {"correct_answer": ["D", "B"], "type ": "SA", "A_q": "Remind him of long term goals, and the growth that is still possible and how his current achievement reflects that. basically tell him how great he's done and tell him he's going to continue to better in the future.", "B_q": "Your hard work has paid off! keep up with the great work!.", "C_q": "One of the most important things about growth mindset is giving feedback on the task that mark is doing and not on his own personality of him being a talented musician. one growth mindset instruction his instructor could give him is \"great work in your performance today. keep up with your perseverance.\"", "D_q": "Your persistence in practicing chord changes resulted in you altering this song."}, {"correct_answer": "A", "type ": "MC", "A_q": "Not really, jigsaw does not help students understand the brain or intelligence which is a prerequisite for a growth mindset.", "B_q": "I think so. because jigsaw demonstrates to students that they can always learn from other people. what's more, it shows that they can not only learn themselves, but also help other people to improve together.", "C_q": "Yes, because it gives them the confidence that they can master a concept enough to teach others and help others do well when tested on that concept.", "D_q": "Yes, for example carlos, have developed a growth-mindset, while he thought he was stupid he later think he is smart."}]]}